# DataFrame

1. A dataFrame is a collection of values
2. A dataframe is a table like structure having some rows and some columns
3. In a Dataframe, we can store any type of value. However, in a single column, all the values in that column should be of the same type only.

In [ ]:
A dataframe consists of three components
1. Dataframe Values
2. Column Labels/ Column Names
3. Row Labels/ Row Names/ dataframe index

# 1. Creating a DataFrame by using a dictionary

When we are creating a Dataframe with a dictionary, the keys in the dictionary will act as column labels, and the values in the dictionary will act as dataframe values. And make sure that the values in the dictionary are in the form of a collection

In [ ]:
import pandas as pd

In [ ]:
df=pd.DataFrame({"Runs":[49,23,100],"Player":["Rohit","Kohli","Pant"],"Age":[33,32,24]})

In [ ]:
df

   Runs Player  Age
0    49  Rohit   33
1    23  Kohli   32
2   100   Pant   24

1. A dataFrame is a collection of values
2. A dataframe is a table like structure having some rows and some columns
3. In a Dataframe, we can store any type of value. However, in a single column, all the values in that column should be of the same type only.

In [ ]:
df=pd.DataFrame({"Runs":[49,23.0,100],"Player":["Rohit","Kohli","Pant"],"Age":[33,32,24]})

In [ ]:
df

    Runs Player  Age
0   49.0  Rohit   33
1   23.0  Kohli   32
2  100.0   Pant   24

# 2. Create DataFrames using a csv (comma separated values) file

Someone else will create the csv file, and put the data in it. We just have to read the data from the csv file, and convert that data to a dataframe

The first line in the csv file, will act as column labels. Then from the next line onwards, we will hav row labels and dataframevalues

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players  Age
A    20   kohli   32
B    40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players  Age
0    20   kohli   32
1    40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players  Age
A    20   kohli   32
B    40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Unnamed: 1  Age
A    20      kohli   32
B    40      Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Unnamed: 0 Players  Age
A          20   kohli   32
B          40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players  Age
A    20   kohli   32
B    40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players  Age
A    20     NaN   32
B    40   Rohit   33

In [ ]:
df=pd.read_csv("D:/Datasets/DeloitteTest.csv")

In [ ]:
df

   Runs Players   Age
A    20     NaN  32.0
B    40   Rohit   NaN

In [ ]:
df=pd.DataFrame({"Runs":[49,23.0,100],"Player":["Rohit","Kohli","Pant"],"Age":[33,32,24]})

In [ ]:
df

    Runs Player  Age
0   49.0  Rohit   33
1   23.0  Kohli   32
2  100.0   Pant   24

In [ ]:
df=pd.DataFrame({"Runs":[49,23.0,100],"Player":["Rohit","Kohli","Pant"],"Age":[33,32,24]},index=["A","B","C"])

In [ ]:
df

    Runs Player  Age
A   49.0  Rohit   33
B   23.0  Kohli   32
C  100.0   Pant   24

# Rename Labels

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.rename({"Unnamed: 1":"cars_per_cap"},axis="columns")

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df=df.rename({"Unnamed: 1":"cars_per_cap"},axis="columns")

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.rename({"Unnamed: 1":"cars_per_cap"},axis="columns",inplace=True)

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df.rename({"Abbreviation":"ShortForm","country":"Nation"},axis='columns',inplace=True)

In [ ]:
df

  ShortForm  cars_per_cap     Nation  drives_right
A        US            45    America          True
B       AUS           731  Australia         False
C       JAP           588      Japan          True
D        IN            18      India         False
E        RU           200     Russia          True
F       MOR            70    Morocco          True
G        EG            45      Egypt          True

In [ ]:
df

  ShortForm  cars_per_cap     Nation  drives_right
A        US            45    America          True
B       AUS           731  Australia         False
C       JAP           588      Japan          True
D        IN            18      India         False
E        RU           200     Russia          True
F       MOR            70    Morocco          True
G        EG            45      Egypt          True

In [ ]:
df.rename({"A":"Joe Biden"},axis="rows",inplace=True)

In [ ]:
df

          ShortForm  cars_per_cap     Nation  drives_right
Joe Biden        US            45    America          True
B               AUS           731  Australia         False
C               JAP           588      Japan          True
D                IN            18      India         False
E                RU           200     Russia          True
F               MOR            70    Morocco          True
G                EG            45      Egypt          True

In [ ]:
df

          ShortForm  cars_per_cap     Nation  drives_right
Joe Biden        US            45    America          True
B               AUS           731  Australia         False
C               JAP           588      Japan          True
D                IN            18      India         False
E                RU           200     Russia          True
F               MOR            70    Morocco          True
G                EG            45      Egypt          True

In [ ]:
df.rename({"D":"Modi","E":"Putin"},axis="rows",inplace=True)

In [ ]:
df

          ShortForm  cars_per_cap     Nation  drives_right
Joe Biden        US            45    America          True
B               AUS           731  Australia         False
C               JAP           588      Japan          True
Modi             IN            18      India         False
Putin            RU           200     Russia          True
F               MOR            70    Morocco          True
G                EG            45      Egypt          True

# Drop rows and columns from a DataFrame

In [ ]:
df

          ShortForm  cars_per_cap     Nation  drives_right
Joe Biden        US            45    America          True
B               AUS           731  Australia         False
C               JAP           588      Japan          True
Modi             IN            18      India         False
Putin            RU           200     Russia          True
F               MOR            70    Morocco          True
G                EG            45      Egypt          True

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.drop("Unnamed: 1",axis='columns',inplace=True)

In [ ]:
df

  Abbreviation    country  drives_right
A           US    America          True
B          AUS  Australia         False
C          JAP      Japan          True
D           IN      India         False
E           RU     Russia          True
F          MOR    Morocco          True
G           EG      Egypt          True

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.drop({"Abbreviation","country"},axis="columns",inplace=True)

In [ ]:
df

   Unnamed: 1  drives_right
A          45          True
B         731         False
C         588          True
D          18         False
E         200          True
F          70          True
G          45          True

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.drop("C",axis="rows",inplace=True)

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  Unnamed: 1    country  drives_right
A           US          45    America          True
B          AUS         731  Australia         False
C          JAP         588      Japan          True
D           IN          18      India         False
E           RU         200     Russia          True
F          MOR          70    Morocco          True
G           EG          45      Egypt          True

In [ ]:
df.drop(["B","D","E"],axis="rows",inplace=True)

In [ ]:
df

  Abbreviation  Unnamed: 1  country  drives_right
A           US          45  America          True
C          JAP         588    Japan          True
F          MOR          70  Morocco          True
G           EG          45    Egypt          True

# Subsetting in a dataframe

# 1. Subset with square brackets

In [ ]:
Drawbacks of this first approach:
1) We cannot subset rows and columns at the same time
2) If we want to subset rows, then we can only subset rows which are consecutive, and that too using slicing.

In [ ]:
df=pd.read_csv("D:/Datasets/cars.csv")

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df["country"]

A      America
B    Australia
C        Japan
D        India
E       Russia
F      Morocco
G        Egypt
Name: country, dtype: object

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df[["Abbreviation","country","drives_right"]]

  Abbreviation    country  drives_right
A           US    America          True
B          AUS  Australia         False
C          JAP      Japan          True
D           IN      India         False
E           RU     Russia          True
F          MOR    Morocco          True
G           EG      Egypt          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

Drawbacks of this first approach:
1) We cannot subset rows and columns at the same time
2) If we want to subset rows, then we can only subset rows which are consecutive, and that too using slicing.

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df[1:3]

  Abbreviation  cars_per_cap    country  drives_right
B          AUS           731  Australia         False
C          JAP           588      Japan          True

In [ ]:
df[3:6]

  Abbreviation  cars_per_cap  country  drives_right
D           IN            18    India         False
E           RU           200   Russia          True
F          MOR            70  Morocco          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df[1:2]

  Abbreviation  cars_per_cap    country  drives_right
B          AUS           731  Australia         False

# 2 and 3: loc and iloc

In [ ]:
syntax for loc

dataframeReference.loc[ RowLabels,ColumnLabels ]

In [ ]:
syntax for iloc

dataframeReference.iloc[ RowIndex,ColumnIndex ]

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
syntax for loc

dataframeReference.loc[ RowLabels,ColumnLabels ]

In [ ]:
df.loc[["B","C","D"] ,["Abbreviation","country"] ]

  Abbreviation    country
B          AUS  Australia
C          JAP      Japan
D           IN      India

In [ ]:
syntax for iloc

dataframeReference.iloc[ RowIndex,ColumnIndex ]

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df.iloc[[1,2,3] ,[0,2] ]

  Abbreviation    country
B          AUS  Australia
C          JAP      Japan
D           IN      India

In [ ]:
df.loc[["B","C","D"] ,["Abbreviation","country"] ]

  Abbreviation    country
B          AUS  Australia
C          JAP      Japan
D           IN      India

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
syntax for loc

dataframeReference.loc[ RowLabels,ColumnLabels ]

In [ ]:
df.loc[ "A",["cars_per_cap","country"] ]

cars_per_cap         45
country         America
Name: A, dtype: object

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
syntax for iloc

dataframeReference.iloc[ RowIndex,ColumnIndex ]

In [ ]:
df.iloc[ 0,[1,2] ]

cars_per_cap         45
country         America
Name: A, dtype: object

In [ ]:
df.loc[ "A",["cars_per_cap","country"] ]

cars_per_cap         45
country         America
Name: A, dtype: object

# Subset using conditions

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. Subset the column of interest, to obtain a series
2. Convert the series using comparison operators in such a way that the values in it are boolean
3. dataframereference[...code uptil step 2...]

In [ ]:
df[df["cars_per_cap"] > 500]

  Abbreviation  cars_per_cap    country  drives_right
B          AUS           731  Australia         False
C          JAP           588      Japan          True

In [ ]:
1. Subset the column of interest, to obtain a series
2. Convert the series using comparison operators in such a way that the values in it are boolean
3. dataframereference[...code uptil step 2...]

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df[df["drives_right"] == True]

  Abbreviation  cars_per_cap  country  drives_right
A           US            45  America          True
C          JAP           588    Japan          True
E           RU           200   Russia          True
F          MOR            70  Morocco          True
G           EG            45    Egypt          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
1. Subset the column of interest, to obtain a series
2. Convert the series using comparison operators in such a way that the values in it are boolean
3. dataframereference[...code uptil step 2...]

In [ ]:
df[ (df["cars_per_cap"]>500)  & (df["drives_right"]==True)]

  Abbreviation  cars_per_cap country  drives_right
C          JAP           588   Japan          True

In [ ]:
df

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
D           IN            18      India         False
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True

In [ ]:
df[ (df["cars_per_cap"]>500)  | (df["drives_right"]==True)]

  Abbreviation  cars_per_cap    country  drives_right
A           US            45    America          True
B          AUS           731  Australia         False
C          JAP           588      Japan          True
E           RU           200     Russia          True
F          MOR            70    Morocco          True
G           EG            45      Egypt          True